const oilExample = {
    summary: [...],
    target1: {
        ...
    },
    target2: {
        ...
    },
    target3: {
        ...
    },
    oilChart: [
        {
            year: '2567',
            pipeTransportation: {
                "การขนส่งน้ำมันทางท่อ": 3,
            },
            fuelProduction: {
                "ปริมาณเอทานอล (ผสมเบนซิน) ผลิตได้ในประเทศ (ทางบก)": 3,
                "ปริมาณไบโอดีเซล (B100) ผลิตได้ในประเทศ (ทางบก)": 3,
                ...
            },
            fuelConsumption: {
                "การใช้น้ำมันเชื้อเพลิงเบนซิน": 3,
                "การใช้น้ำมันเชื้อเพลิงดีเซล": 5,
                ...
            }
        },
        ...
    ],
    charts: {
        ...
    }
}